{
  "nodes": [
    {
      "op": "null", 
      "name": "user_x", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "user_embedding_weight", 
      "attr": {
        "input_dim": "6040", 
        "output_dim": "16"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "user_embedding", 
      "attr": {
        "input_dim": "6040", 
        "output_dim": "16"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "item_x", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "item_embedding_weight", 
      "attr": {
        "input_dim": "3706", 
        "output_dim": "16"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "item_embedding", 
      "attr": {
        "input_dim": "3706", 
        "output_dim": "16"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attr": {
        "dim": "2", 
        "num_args": "2"
      }, 
      "inputs": [[2, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attr": {"shape": "(0, -1)"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fully connected layer 1_weight", 
      "attr": {"num_hidden": "32"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fully connected layer 1_bias", 
      "attr": {"num_hidden": "32"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fully connected layer 1", 
      "attr": {"num_hidden": "32"}, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "activated layer 1", 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fully connected layer 2_weight", 
      "attr": {"num_hidden": "16"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fully connected layer 2_bias", 
      "attr": {"num_hidden": "16"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fully connected layer 2", 
      "attr": {"num_hidden": "16"}, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "activated layer 2", 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fully connected layer 3_weight", 
      "attr": {"num_hidden": "8"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fully connected layer 3_bias", 
      "attr": {"num_hidden": "8"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fully connected layer 3", 
      "attr": {"num_hidden": "8"}, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "activated layer 3", 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout layer 3", 
      "attr": {"p": "0.5"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "pred_weight", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "pred_bias", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "pred", 
      "attr": {"num_hidden": "2"}, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmaxoutput0", 
      "inputs": [[23, 0, 0], [24, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    4, 
    8, 
    9, 
    12, 
    13, 
    16, 
    17, 
    21, 
    22, 
    24
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27
  ], 
  "heads": [[25, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1100]}
}